### Deployment Results :white_check_mark:

 **GrantBirki** successfully **branch** deployed branch `svg-cors` to **production**





<details><summary>Show Results</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # cloudflare_record.socket has been deleted
  - resource "cloudflare_record" "socket" {
      - allow_overwrite = false -> null
      - created_on      = "2026-02-23T13:51:58.246572Z" -> null
      - hostname        = "socket.tarkov.dev" -> null
      - id              = "c81e3fc2d9c0e8c2818cb3cfb7643551" -> null
      - metadata        = {} -> null
      - modified_on     = "2026-02-23T13:51:58.246572Z" -> null
      - name            = "socket" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "zendo4jt.up.railway.app" -> null
      - zone_id         = "a17204c79af55fcf05e4975f66e2490e" -> null
    }

  # cloudflare_ruleset.cache_rules has changed
  ~ resource "cloudflare_ruleset" "cache_rules" {
        id      = "6510b58fb0ac44c9984077e55eb158d0"
        name    = "default"
        # (3 unchanged attributes hidden)

      + rules {
          + action      = "set_cache_settings"
          + description = "R2 API Bucket Cache"
          + enabled     = true
          + expression  = "(http.host eq \"api2.tarkov.dev\") or (http.host eq \"json.tarkov.dev\") or (http.host eq \"json-dev.tarkov.dev\")"
          + id          = "11f7caf8c6d24139aba6dc766ae35a01"

          + action_parameters {
              + automatic_https_rewrites   = false
              + bic                        = false
              + cache                      = true
              + cookie_fields              = []
              + disable_apps               = false
              + disable_railgun            = false
              + disable_zaraz              = false
              + email_obfuscation          = false
              + hotlink_protection         = false
              + increment                  = 0
              + mirage                     = false
              + opportunistic_encryption   = false
              + origin_error_page_passthru = false
              + phases                     = []
              + products                   = []
              + request_fields             = []
              + respect_strong_etags       = false
              + response_fields            = []
              + rocket_loader              = false
              + rules                      = {}
              + rulesets                   = []
              + server_side_excludes       = false
              + status_code                = 0
              + sxg                        = false

              + cache_key {
                  + cache_by_device_type       = false
                  + cache_deception_armor      = false
                  + ignore_query_strings_order = false

                  + custom_key {

                      + query_string {
                          + exclude = []
                          + include = []
                        }
                    }
                }

              + edge_ttl {
                  + default = 2678400
                  + mode    = "override_origin"
                }
            }
        }
        # (7 unchanged blocks hidden)
    }

  # cloudflare_ruleset.security_response_headers has changed
  ~ resource "cloudflare_ruleset" "security_response_headers" {
        id          = "99896b7130154c279bd0dd1d94f109ec"
        name        = "Security Response Headers"
        # (4 unchanged attributes hidden)

      + rules {
          + action      = "rewrite"
          + description = "Add CORS header to api2"
          + enabled     = true
          + expression  = "(http.host eq \"api2.tarkov.dev\")"
          + id          = "3f24d80bbcd94b809909c632c457cfe0"

          + action_parameters {
              + automatic_https_rewrites   = false
              + bic                        = false
              + cache                      = false
              + cookie_fields              = []
              + disable_apps               = false
              + disable_railgun            = false
              + disable_zaraz              = false
              + email_obfuscation          = false
              + hotlink_protection         = false
              + increment                  = 0
              + mirage                     = false
              + opportunistic_encryption   = false
              + origin_error_page_passthru = false
              + phases                     = []
              + products                   = []
              + request_fields             = []
              + respect_strong_etags       = false
              + response_fields            = []
              + rocket_loader              = false
              + rules                      = {}
              + rulesets                   = []
              + server_side_excludes       = false
              + status_code                = 0
              + sxg                        = false

              + headers {
                  + name      = "Access-Control-Allow-Origin"
                  + operation = "set"
                  + value     = "*"
                }
            }
        }
        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_record.socket will be created
  + resource "cloudflare_record" "socket" {
      + allow_overwrite = true
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "socket"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "843dlh0u.up.railway.app"
      + zone_id         = "a17204c79af55fcf05e4975f66e2490e"
    }

  # cloudflare_ruleset.cache_rules will be updated in-place
  ~ resource "cloudflare_ruleset" "cache_rules" {
        id      = "6510b58fb0ac44c9984077e55eb158d0"
        name    = "default"
        # (3 unchanged attributes hidden)

      - rules {
          - action      = "set_cache_settings" -> null
          - description = "R2 API Bucket Cache" -> null
          - enabled     = true -> null
          - expression  = "(http.host eq \"api2.tarkov.dev\") or (http.host eq \"json.tarkov.dev\") or (http.host eq \"json-dev.tarkov.dev\")" -> null
          - id          = "11f7caf8c6d24139aba6dc766ae35a01" -> null

          - action_parameters {
              - automatic_https_rewrites   = false -> null
              - bic                        = false -> null
              - cache                      = true -> null
              - cookie_fields              = [] -> null
              - disable_apps               = false -> null
              - disable_railgun            = false -> null
              - disable_zaraz              = false -> null
              - email_obfuscation          = false -> null
              - hotlink_protection         = false -> null
              - increment                  = 0 -> null
              - mirage                     = false -> null
              - opportunistic_encryption   = false -> null
              - origin_error_page_passthru = false -> null
              - phases                     = [] -> null
              - products                   = [] -> null
              - request_fields             = [] -> null
              - respect_strong_etags       = false -> null
              - response_fields            = [] -> null
              - rocket_loader              = false -> null
              - rules                      = {} -> null
              - rulesets                   = [] -> null
              - server_side_excludes       = false -> null
              - status_code                = 0 -> null
              - sxg                        = false -> null

              - cache_key {
                  - cache_by_device_type       = false -> null
                  - cache_deception_armor      = false -> null
                  - ignore_query_strings_order = false -> null

                  - custom_key {

                      - query_string {
                          - exclude = [] -> null
                          - include = [] -> null
                        }
                    }
                }

              - edge_ttl {
                  - default = 2678400 -> null
                  - mode    = "override_origin" -> null
                }
            }
        }
        # (7 unchanged blocks hidden)
    }

  # cloudflare_ruleset.security_response_headers will be updated in-place
  ~ resource "cloudflare_ruleset" "security_response_headers" {
        id          = "99896b7130154c279bd0dd1d94f109ec"
        name        = "Security Response Headers"
        # (4 unchanged attributes hidden)

      - rules {
          - action      = "rewrite" -> null
          - description = "Add CORS header to api2" -> null
          - enabled     = true -> null
          - expression  = "(http.host eq \"api2.tarkov.dev\")" -> null
          - id          = "3f24d80bbcd94b809909c632c457cfe0" -> null

          - action_parameters {
              - automatic_https_rewrites   = false -> null
              - bic                        = false -> null
              - cache                      = false -> null
              - cookie_fields              = [] -> null
              - disable_apps               = false -> null
              - disable_railgun            = false -> null
              - disable_zaraz              = false -> null
              - email_obfuscation          = false -> null
              - hotlink_protection         = false -> null
              - increment                  = 0 -> null
              - mirage                     = false -> null
              - opportunistic_encryption   = false -> null
              - origin_error_page_passthru = false -> null
              - phases                     = [] -> null
              - products                   = [] -> null
              - request_fields             = [] -> null
              - respect_strong_etags       = false -> null
              - response_fields            = [] -> null
              - rocket_loader              = false -> null
              - rules                      = {} -> null
              - rulesets                   = [] -> null
              - server_side_excludes       = false -> null
              - status_code                = 0 -> null
              - sxg                        = false -> null

              - headers {
                  - name      = "Access-Control-Allow-Origin" -> null
                  - operation = "set" -> null
                  - value     = "*" -> null
                }
            }
        }
        # (3 unchanged blocks hidden)
    }

  # cloudflare_zone_settings_override.tarkov_dev will be updated in-place
  ~ resource "cloudflare_zone_settings_override" "tarkov_dev" {
        id                       = "a17204c79af55fcf05e4975f66e2490e"
        # (6 unchanged attributes hidden)

      ~ settings {
            # (51 unchanged attributes hidden)

          ~ minify {
              ~ css  = "off" -> "on"
              ~ html = "off" -> "on"
              ~ js   = "off" -> "on"
            }

            # (2 unchanged blocks hidden)
        }
    }

Plan: 1 to add, 3 to change, 0 to destroy.
cloudflare_record.socket: Creating...
cloudflare_zone_settings_override.tarkov_dev: Modifying... [id=a17204c79af55fcf05e4975f66e2490e]
cloudflare_ruleset.security_response_headers: Modifying... [id=99896b7130154c279bd0dd1d94f109ec]
cloudflare_ruleset.cache_rules: Modifying... [id=6510b58fb0ac44c9984077e55eb158d0]
cloudflare_ruleset.security_response_headers: Modifications complete after 2s [id=99896b7130154c279bd0dd1d94f109ec]
cloudflare_ruleset.cache_rules: Modifications complete after 2s [id=6510b58fb0ac44c9984077e55eb158d0]
cloudflare_record.socket: Creation complete after 3s [id=d5622711d0be4ef4f58a9fc7b7fb7bed]
cloudflare_zone_settings_override.tarkov_dev: Modifications complete after 4s [id=a17204c79af55fcf05e4975f66e2490e]

Apply complete! Resources: 1 added, 3 changed, 0 destroyed.

```

</details>
